Catalogs/LM_Абонемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>LM_Абонемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заморозка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаморозки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗамрозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заморозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЗаморозки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРазморозки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/LM_Абонемент/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Активировать(Команда)
	Объект.Активный = НЕ Объект.Активный;
	Если Объект.Активный Тогда
		Объект.ДатаАктивации = ТекущаяДата();	
	КонецЕсли;  	
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Заморозить(Команда)
	Если Объект.Активный Тогда
		Объект.Заморозка = НЕ Объект.Заморозка;
		Если Объект.Заморозка Тогда
			Объект.ДатаЗаморозки = ТекущаяДата();
		КонецЕсли;
		ОбновитьВидимость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Элементы.Период.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Период.ТолькоПросмотр = Ложь;;
	КонецЕсли;
	
	Период.ДатаНачала 		= Объект.ДатаНачала;
	Период.ДатаОкончания 	= Объект.ДатаОкончания;
	
	Если Объект.Активный Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаЗаморозки) Тогда
			Элементы.ДатаЗаморозки.Заголовок = "Дата последней заморозки";
		КонецЕсли; 
	
		Элементы.ГруппаЗаморозка.Доступность = Истина;
		Если Объект.Заморозка Тогда
			Элементы.Активировать.Заголовок 		= "Блокировать";
			Элементы.Активировать.ЦветФона 			= WebЦвета.ТусклоРозовый;
			Элементы.Заморозить.Заголовок 			= "Разморозить";
			Элементы.ДекорацияСтатус.Заголовок 		= "Заморожен";
			Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.Циан;
			Элементы.СрокЗамрозки.ТолькоПросмотр 	= Истина;
		Иначе
			Элементы.ДекорацияСтатус.Заголовок 		= "Активен";
			Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.ЗеленоватоЖелтый;
			Элементы.Заморозить.Заголовок 			= "Заморозить";
			Элементы.СрокЗамрозки.ТолькоПросмотр 	= Ложь;
		КонецЕсли;
	Иначе
		Элементы.Активировать.Заголовок 		= "Активировать";
		Элементы.Активировать.ЦветФона 			= WebЦвета.ЗеленоватоЖелтый;
		Элементы.ДекорацияСтатус.Заголовок 		= "Неактивен";
		Элементы.ДекорацияСтатус.ЦветФона 		= WebЦвета.СветлоСерый;
		Элементы.ГруппаЗаморозка.Доступность 	= Ложь;
	КонецЕсли;
		
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Уроки.Параметры.УстановитьЗначениеПараметра("Абонемент", Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьФизЛицо(Команда)
	Элементы.ФизЛицо.ТолькоПросмотр = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьПериод(Команда)
	Элементы.Период.ТолькоПросмотр = Ложь;
КонецПроцедуры
